#날짜 : 2021/01/18
#이름 : 이슬이
#내용 : Ch02. 데이터 유형과 구조 - Matrix 자료구조 교재 p63

#행렬(Matrix)
m1 <- matrix(c(1:12))
m1

m2 <- matrix(1:12, nrow = 3, ncol = 4)
m2

m3 <- matrix(1:12, nrow = 3)
m3
m3[1,1]
m3[1,3]
m3[3,3]

m4 <- matrix(1:12, 3, byrow = T) #행우선
m4

m5 <- matrix(1:12, 4, byrow = F) #열우선
m5

#행렬 성분 출력
x <- c(1, 2)
y <- c(3 ,4)

M1 <- rbind(x, y) #행결합
M2 <- cbind(x, y) #열결합
M1
M2
M1[1,]

M3 <- rbind(1:3, 4:6)
M3

M4 <- cbind(1:3, 4:6)
M4

#행렬연산
M1 + M2
M1 - M2
M1 * M2
M1 %*% M2


#교재 p64 실습 - 벡터를 이용한 행렬 객체 생성
m <- matrix(c(1:5))
m

#교재 p64 실습 - 벡터의 열 우선으로 행렬 객체 생성하기
m <- matrix(c(1:10), nrow = 2)
m

#교재 p64 실습 - 행과 열의 수가 일치하지 않는 경우
m <- matrix(c(1:11), nrow = 2)
m

#교재 p65 실습 - 벡터의 행 우선으로 행렬 객체 생성하기
m <- matrix(c(1:10), nrow = 2, byrow = T)  #byrow = T: 행 우선
m

#교재 p65 실습 - 행 묶음으로 행렬 객체 생성하기
#교재 p65 실습 - 열 묶음으로 행렬 객체 생성하기

#교재 p66 실습 - 2행으로 행렬 객체 생성하기
#교재 p66 실습 - 첨자를 사용하여 행렬 객체에 접근하기

#교재 p67 실습 - 3행 3열의 행렬 객체 생성하기
#교재 p67 실습 - 자료의 갯수 보기
#교재 p67 실습 - apply()함수 적용하기
