#날짜 : 2021/01/18
#이름 : 이슬이
#내용 : Ch02. 데이터 유형과 구조 - Matrix 자료구조 교재 p63

#행렬(Matrix)
m1 <- matrix(c(1:12))
m1

m2 <- matrix(1:12, nrow = 3, ncol = 4)
m2

m3 <- matrix(1:12, nrow = 3)
m3
m3[1,1]
m3[1,3]
m3[3,3]

m4 <- matrix(1:12, 3, byrow = T) #행우선
m4

m5 <- matrix(1:12, 4, byrow = F) #열우선
m5

#행렬 성분 출력
x <- c(1, 2)
y <- c(3 ,4)

M1 <- rbind(x, y) #행결합
M2 <- cbind(x, y) #열결합
M1
M2
M1[1,]

M3 <- rbind(1:3, 4:6)
M3

M4 <- cbind(1:3, 4:6)
M4

#행렬연산
M1 + M2
M1 - M2
M1 * M2
M1 %*% M2


#교재 p64 실습 - 벡터를 이용한 행렬 객체 생성
m <- matrix(c(1:5))
m

#교재 p64 실습 - 벡터의 열 우선으로 행렬 객체 생성하기
m <- matrix(c(1:10), nrow = 2)
m

#교재 p64 실습 - 행과 열의 수가 일치하지 않는 경우
m <- matrix(c(1:11), nrow = 2)
m

#교재 p65 실습 - 벡터의 행 우선으로 행렬 객체 생성하기
m <- matrix(c(1:10), nrow = 2, byrow = T)  #byrow = T: 행 우선
m

#교재 p65 실습 - 행 묶음으로 행렬 객체 생성하기
x1 <- c(5, 40, 50:52)
x2 <- c(30, 5, 6:8)
mr <- rbind(x1, x2)
mr

#교재 p65 실습 - 열 묶음으로 행렬 객체 생성하기
mc <- cbind(x1, x2)
mc

#교재 p66 실습 - 2행으로 행렬 객체 생성하기
m3 <- matrix(10:19, 2)       #10개 데이터를 2행으로 하여 행렬 객체 생성
m4 <- matrix(10:20, 2)       #error 발생: 데이터 개수가 홀수
#경고메시지(들): In matrix(10:20, 2) : 데이터의 길이[11]가 행의 개수[2]의 배수가 되지 않습니다

m3                           #2행 5열의 matrix 객체 확인

mode(m3); class(m3)          #행렬 객체에 대한 자료형과 자료구조보기

#교재 p66 실습 - 첨자를 사용하여 행렬 객체에 접근하기
m3[1,]                       #1행 전체 원소 출력
m3[, 5]                      #5열 전체의 원소 출력
m3[2, 3]                     #2행 3열의 원소 1개를 출력
m3[1, c(2:5)]                #1행에서 2~5열의 원소 4개를 출력

#교재 p67 실습 - 3행 3열의 행렬 객체 생성하기
x <- matrix(c(1:9), nrow = 3, ncol = 3)  #열 우선 3행 3열 지정
x

#교재 p67 실습 - 자료의 갯수 보기
length(x)   #행렬 객체의 전체 원소 개수를 반환
ncol(x)     #열 수와 행 수를 반환

#교재 p67 실습 - apply()함수 적용하기
apply(x, 1, max)    #행 단위로 각 행의 최대값 구하기
apply(x, 1, min)    #행 단위로 각 행의 최소값 구하기
apply(x, 2, mean)   #열 단위로 각 열의 평균균값 구하기
